Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D14AU.atdf
        <register name="AVGCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Average Control">
          <bitfield name="SAMPLENUM" caption="Number of Samples to be Collected" mask="0xF" values="ADC_AVGCTRL__SAMPLENUM"/>
          <bitfield name="ADJRES" caption="Adjusting Result / Division Coefficient" mask="0x70"/>
        </register>
        <register name="SAMPCTRL" offset="0x3" rw="RW" size="1" initval="0x00" caption="Sampling Time Control">
          <bitfield name="SAMPLEN" caption="Sampling Time Length" mask="0x3F"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Control B">
          <bitfield name="DIFFMODE" caption="Differential Mode" mask="0x1"/>
          <bitfield name="LEFTADJ" caption="Left-Adjusted Result" mask="0x2"/>
          <bitfield name="FREERUN" caption="Free Running Mode" mask="0x4"/>
          <bitfield name="CORREN" caption="Digital Correction Logic Enabled" mask="0x8"/>
          <bitfield name="RESSEL" caption="Conversion Result Resolution" mask="0x30" values="ADC_CTRLB__RESSEL"/>
          <bitfield name="PRESCALER" caption="Prescaler Configuration" mask="0x700" values="ADC_CTRLB__PRESCALER"/>
        </register>
        <register name="WINCTRL" offset="0x8" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Window Monitor Control">
          <bitfield name="WINMODE" caption="Window Monitor Mode" mask="0x7" values="ADC_WINCTRL__WINMODE"/>
        </register>
        <register name="SWTRIG" offset="0xC" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Software Trigger">
          <bitfield name="FLUSH" caption="ADC Conversion Flush" mask="0x1"/>
          <bitfield name="START" caption="ADC Start Conversion" mask="0x2"/>
        </register>
        <register name="INPUTCTRL" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Input Control">
          <bitfield name="MUXPOS" caption="Positive Mux Input Selection" mask="0x1F" values="ADC_INPUTCTRL__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Mux Input Selection" mask="0x1F00" values="ADC_INPUTCTRL__MUXNEG"/>
          <bitfield name="INPUTSCAN" caption="Number of Input Channels Included in Scan" mask="0xF0000"/>
          <bitfield name="INPUTOFFSET" caption="Positive Mux Setting Offset" mask="0xF00000"/>
          <bitfield name="GAIN" caption="Gain Factor Selection" mask="0xF000000" values="ADC_INPUTCTRL__GAIN"/>
        </register>
        <register name="EVCTRL" offset="0x14" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI" caption="Start Conversion Event In" mask="0x1"/>
          <bitfield name="SYNCEI" caption="Synchronization Event In" mask="0x2"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
          <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x16" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTENSET" offset="0x17" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="RESRDY" caption="Result Ready" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor" mask="0x4"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x8"/>
        </register>
        <register name="STATUS" offset="0x19" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
        </register>
        <register name="RESULT" offset="0x1A" rw="R" access="RSYNC" size="2" initval="0x0000" caption="Result">
          <bitfield name="RESULT" caption="Result Conversion Value" mask="0xFFFF"/>
        </register>
        <register name="WINLT" offset="0x1C" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Window Monitor Lower Threshold">
          <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFF"/>
        </register>
        <register name="WINUT" offset="0x20" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Window Monitor Upper Threshold">
          <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFF"/>
        </register>
        <register name="GAINCORR" offset="0x24" rw="RW" size="2" initval="0x0000" caption="Gain Correction">
          <bitfield name="GAINCORR" caption="Gain Correction Value" mask="0xFFF"/>
        </register>
        <register name="OFFSETCORR" offset="0x26" rw="RW" size="2" initval="0x0000" caption="Offset Correction">
          <bitfield name="OFFSETCORR" caption="Offset Correction Value" mask="0xFFF"/>
        </register>
        <register name="CALIB" offset="0x28" rw="RW" size="2" initval="0x0000" caption="Calibration">
          <bitfield name="LINEARITY_CAL" caption="Linearity Calibration Value" mask="0xFF"/>
          <bitfield name="BIAS_CAL" caption="Bias Calibration Value" mask="0x700"/>
        </register>
