Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D14AU.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT0" caption="External Interrupt 0" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7" mask="0x80"/>
        </register>
        <register name="WAKEUP" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Wake-Up Enable">
          <bitfield name="WAKEUPEN0" caption="External Interrupt 0 Wake-up Enable" mask="0x1"/>
          <bitfield name="WAKEUPEN1" caption="External Interrupt 1 Wake-up Enable" mask="0x2"/>
          <bitfield name="WAKEUPEN2" caption="External Interrupt 2 Wake-up Enable" mask="0x4"/>
          <bitfield name="WAKEUPEN3" caption="External Interrupt 3 Wake-up Enable" mask="0x8"/>
          <bitfield name="WAKEUPEN4" caption="External Interrupt 4 Wake-up Enable" mask="0x10"/>
          <bitfield name="WAKEUPEN5" caption="External Interrupt 5 Wake-up Enable" mask="0x20"/>
          <bitfield name="WAKEUPEN6" caption="External Interrupt 6 Wake-up Enable" mask="0x40"/>
          <bitfield name="WAKEUPEN7" caption="External Interrupt 7 Wake-up Enable" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x18" rw="RW" size="4" count="1" initval="0x00000000" caption="Configuration n">
          <bitfield name="SENSE0" caption="Input Sense 0 Configuration" mask="0x7" values="EIC_CONFIG__SENSE0"/>
          <bitfield name="FILTEN0" caption="Filter 0 Enable" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense 1 Configuration" mask="0x70" values="EIC_CONFIG__SENSE1"/>
          <bitfield name="FILTEN1" caption="Filter 1 Enable" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense 2 Configuration" mask="0x700" values="EIC_CONFIG__SENSE2"/>
          <bitfield name="FILTEN2" caption="Filter 2 Enable" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense 3 Configuration" mask="0x7000" values="EIC_CONFIG__SENSE3"/>
          <bitfield name="FILTEN3" caption="Filter 3 Enable" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense 4 Configuration" mask="0x70000" values="EIC_CONFIG__SENSE4"/>
          <bitfield name="FILTEN4" caption="Filter 4 Enable" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense 5 Configuration" mask="0x700000" values="EIC_CONFIG__SENSE5"/>
          <bitfield name="FILTEN5" caption="Filter 5 Enable" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense 6 Configuration" mask="0x7000000" values="EIC_CONFIG__SENSE6"/>
          <bitfield name="FILTEN6" caption="Filter 6 Enable" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense 7 Configuration" mask="0x70000000" values="EIC_CONFIG__SENSE7"/>
          <bitfield name="FILTEN7" caption="Filter 7 Enable" mask="0x80000000"/>
        </register>
      </register-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE0">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
