Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D14AU.atdf
        <register name="EVCTRL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EVACT0" caption="Timer/counter Input Event0 Action" mask="0x7" values="TCC_EVCTRL__EVACT0"/>
          <bitfield name="EVACT1" caption="Timer/counter Input Event1 Action" mask="0x38" values="TCC_EVCTRL__EVACT1"/>
          <bitfield name="CNTSEL" caption="Timer/counter Output Event Mode" mask="0xC0" values="TCC_EVCTRL__CNTSEL"/>
          <bitfield name="OVFEO" caption="Overflow/Underflow Output Event Enable" mask="0x100"/>
          <bitfield name="TRGEO" caption="Retrigger Output Event Enable" mask="0x200"/>
          <bitfield name="CNTEO" caption="Timer/counter Output Event Enable" mask="0x400"/>
          <bitfield name="TCINV0" caption="Inverted Event 0 Input Enable" mask="0x1000"/>
          <bitfield name="TCINV1" caption="Inverted Event 1 Input Enable" mask="0x2000"/>
          <bitfield name="TCEI0" caption="Timer/counter Event 0 Input Enable" mask="0x4000"/>
          <bitfield name="TCEI1" caption="Timer/counter Event 1 Input Enable" mask="0x8000"/>
          <bitfield name="MCEI0" caption="Match or Capture Channel 0 Event Input Enable" mask="0x10000"/>
          <bitfield name="MCEI1" caption="Match or Capture Channel 1 Event Input Enable" mask="0x20000"/>
          <bitfield name="MCEI2" caption="Match or Capture Channel 2 Event Input Enable" mask="0x40000"/>
          <bitfield name="MCEI3" caption="Match or Capture Channel 3 Event Input Enable" mask="0x80000"/>
          <bitfield name="MCEO0" caption="Match or Capture Channel 0 Event Output Enable" mask="0x1000000"/>
          <bitfield name="MCEO1" caption="Match or Capture Channel 1 Event Output Enable" mask="0x2000000"/>
          <bitfield name="MCEO2" caption="Match or Capture Channel 2 Event Output Enable" mask="0x4000000"/>
          <bitfield name="MCEO3" caption="Match or Capture Channel 3 Event Output Enable" mask="0x8000000"/>
        </register>
        <register name="INTENCLR" offset="0x24" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="TRG" caption="Retrigger Interrupt Enable" mask="0x2"/>
          <bitfield name="CNT" caption="Counter Interrupt Enable" mask="0x4"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x8"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault Interrupt Enable" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A Interrupt Enable" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B Interrupt Enable" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 Interrupt Enable" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 Interrupt Enable" mask="0x8000"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10000"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20000"/>
          <bitfield name="MC2" caption="Match or Capture Channel 2 Interrupt Enable" mask="0x40000"/>
          <bitfield name="MC3" caption="Match or Capture Channel 3 Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTENSET" offset="0x28" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="TRG" caption="Retrigger Interrupt Enable" mask="0x2"/>
          <bitfield name="CNT" caption="Counter Interrupt Enable" mask="0x4"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x8"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault Interrupt Enable" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A Interrupt Enable" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B Interrupt Enable" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 Interrupt Enable" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 Interrupt Enable" mask="0x8000"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10000"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20000"/>
          <bitfield name="MC2" caption="Match or Capture Channel 2 Interrupt Enable" mask="0x40000"/>
          <bitfield name="MC3" caption="Match or Capture Channel 3 Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTFLAG" offset="0x2C" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="TRG" caption="Retrigger" mask="0x2"/>
          <bitfield name="CNT" caption="Counter" mask="0x4"/>
          <bitfield name="ERR" caption="Error" mask="0x8"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1" mask="0x8000"/>
          <bitfield name="MC0" caption="Match or Capture 0" mask="0x10000"/>
          <bitfield name="MC1" caption="Match or Capture 1" mask="0x20000"/>
          <bitfield name="MC2" caption="Match or Capture 2" mask="0x40000"/>
          <bitfield name="MC3" caption="Match or Capture 3" mask="0x80000"/>
        </register>
        <register name="STATUS" offset="0x30" rw="RW" size="4" initval="0x00000001" caption="Status">
          <bitfield name="STOP" caption="Stop" mask="0x1"/>
          <bitfield name="IDX" caption="Ramp" mask="0x2"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault State" mask="0x8"/>
          <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
          <bitfield name="PATTBV" caption="Pattern Buffer Valid" mask="0x20"/>
          <bitfield name="WAVEBV" caption="Wave Buffer Valid" mask="0x40"/>
          <bitfield name="PERBV" caption="Period Buffer Valid" mask="0x80"/>
          <bitfield name="FAULTAIN" caption="Recoverable Fault A Input" mask="0x100"/>
          <bitfield name="FAULTBIN" caption="Recoverable Fault B Input" mask="0x200"/>
          <bitfield name="FAULT0IN" caption="Non-Recoverable Fault0 Input" mask="0x400"/>
          <bitfield name="FAULT1IN" caption="Non-Recoverable Fault1 Input" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A State" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B State" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 State" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 State" mask="0x8000"/>
          <bitfield name="CCBV0" caption="Compare Channel 0 Buffer Valid" mask="0x10000"/>
          <bitfield name="CCBV1" caption="Compare Channel 1 Buffer Valid" mask="0x20000"/>
          <bitfield name="CCBV2" caption="Compare Channel 2 Buffer Valid" mask="0x40000"/>
          <bitfield name="CCBV3" caption="Compare Channel 3 Buffer Valid" mask="0x80000"/>
          <bitfield name="CMP0" caption="Compare Channel 0 Value" mask="0x1000000"/>
          <bitfield name="CMP1" caption="Compare Channel 1 Value" mask="0x2000000"/>
          <bitfield name="CMP2" caption="Compare Channel 2 Value" mask="0x4000000"/>
          <bitfield name="CMP3" caption="Compare Channel 3 Value" mask="0x8000000"/>
        </register>
        <register name="COUNT" offset="0x34" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="Count">
          <mode name="DITH4">
            <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFF0"/>
          </mode>
          <mode name="DITH5">
            <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFE0"/>
          </mode>
          <mode name="DITH6">
            <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFC0"/>
          </mode>
          <mode name="DEFAULT_MODE">
            <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFF"/>
          </mode>
        </register>
