Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D14AU.atdf
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module></modules>
  <pinouts>
    <pinout name="SAMD1xDU" caption="SAMD1xDU">
      <pin position="A1" pad="PA02"/>
      <pin position="A2" pad="PA03"/>
      <pin position="A3" pad="PA04"/>
      <pin position="A4" pad="PA06"/>
      <pin position="B1" pad="VDDIO"/>
      <pin position="B2" pad="PA05"/>
      <pin position="B3" pad="PA07"/>
      <pin position="B4" pad="PA08"/>
      <pin position="C1" pad="PA25"/>
      <pin position="C2" pad="GNDIO"/>
      <pin position="C3" pad="PA16"/>
      <pin position="C4" pad="PA09"/>
      <pin position="D1" pad="PA24"/>
      <pin position="D2" pad="PA30"/>
      <pin position="D3" pad="PA23"/>
      <pin position="D4" pad="PA14"/>
      <pin position="E1" pad="PA31"/>
      <pin position="E2" pad="PA28"/>
      <pin position="E3" pad="PA22"/>
      <pin position="E4" pad="PA15"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>